spec_version: "1.7"
version: 1
serial_number: "urn:uuid:df628836-6b9b-41c9-a724-b44743c54d42"
metadata {
  lifecycles {
    phase: LIFECYCLE_PHASE_DESIGN
  }
}
components {
  type: CLASSIFICATION_LIBRARY
  group: "com.example"
  name: "situation-A"
  version: "1"
  description: "Multiple licenses: declared ids/names, and a concluded expression"
  licenses {
    license {
      id: "MIT"
      acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_DECLARED
    }
  }
  licenses {
    license {
      id: "PostgreSQL"
      acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_DECLARED
    }
  }
  licenses {
    license {
      name: "Apache Software License"
      acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_DECLARED
    }
  }
  licenses {
    expression: "(MIT OR PostgreSQL OR Apache-2.0)"
    acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_CONCLUDED
  }
}
components {
  type: CLASSIFICATION_LIBRARY
  group: "com.example"
  name: "situation-B"
  version: "1"
  description: "Multiple license expressions: one declared, one concluded"
  licenses {
    expression: "MIT OR (GPL-3.0 OR GPL-2.0)"
    acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_DECLARED
  }
  licenses {
    expression: "(GPL-3.0-only AND LGPL-2.0-only)"
    acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_CONCLUDED
  }
}
components {
  type: CLASSIFICATION_LIBRARY
  group: "com.example"
  name: "situation-C"
  version: "1"
  description: "Multiple license: one declared expression, one concluded id"
  licenses {
    expression: "GPL-3.0-or-later OR GPL-2.0"
    acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_DECLARED
  }
  licenses {
    license {
      id: "GPL-3.0-only"
      acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_CONCLUDED
    }
  }
}
components {
  type: CLASSIFICATION_LIBRARY
  group: "com.example"
  name: "situation-D"
  version: "1"
  description: "Multiple license with texts: one declared expression, one concluded id"
  licenses {
    expression: "GPL-3.0-or-later OR GPL-2.0"
    acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_DECLARED
    6 {
      1: "GPL-3.0-or-later"
      3 {
        1: "text/plain"
        3: "specific GPL-3.0-or-later license text"
      }
    }
    6 {
      1: "GPL-2.0"
      3 {
        1: "text/plain"
        3: "specific GPL-2.0 license text"
      }
    }
  }
  licenses {
    license {
      id: "GPL-3.0-only"
      text {
        content_type: "text/plain"
        value: "specific GPL-3.0-or-later license text"
      }
      acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_CONCLUDED
    }
  }
}
components {
  type: CLASSIFICATION_LIBRARY
  group: "com.example"
  name: "situation-E"
  version: "1"
  description: "Multiple licenses with urls: declared ids/names, and a concluded expression"
  licenses {
    license {
      id: "MIT"
      url: "https://example.com/licenses/MIT"
      acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_DECLARED
    }
  }
  licenses {
    license {
      id: "PostgreSQL"
      url: "https://example.com/licenses/PostgreSQL"
      acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_DECLARED
    }
  }
  licenses {
    license {
      name: "Apache Software License"
      url: "https://example.com/licenses/Apache-2.0"
      acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_DECLARED
    }
  }
  licenses {
    expression: "(MIT AND PostgreSQL AND Apache-2.0)"
    acknowledgement: LICENSE_ACKNOWLEDGEMENT_ENUMERATION_CONCLUDED
    6 {
      1: "MIT"
      4: "https://example.com/licenses/MIT"
    }
    6 {
      1: "PostgreSQL"
      4: "https://example.com/licenses/PostgreSQL"
    }
    6 {
      1: "Apache-2.0"
      4: "https://example.com/licenses/Apache-2.0"
    }
  }
}
